app/controllers/components_controller.rb

  def index
    @response = @syllabus.components.all
---
SELECT "components".* FROM "components" WHERE "components"."syllabus_id" = ?  [["syllabus_id", 2]]

  def create
    params.permit!
    if params[:component][:component_type]=="calendar" #creates calendar out of table
      params[:component][:component_type] = "table"
      dates = generate_dates(Date.parse(params[:component][:start_date]), Date.parse(params[:component][:end_date]), params[:component][:meeting_days], vacation_days)
      new_contents = []
      new_contents.push(Array.new(params[:component][:table_attributes][:columns], "Column Title"))
---
INSERT INTO "components" ("created_at", "syllabus_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 23 Oct 2014 19:19:30 UTC +00:00], ["syllabus_id", 1], ["updated_at", Thu, 23 Oct 2014 19:19:30 UTC +00:00]]

  def find_syllabus
    @syllabus = Syllabus.find(params[:syllabus_id])
    @user = User.find(@syllabus[:user_id])
---
SELECT "syllabuses".* FROM "syllabuses" WHERE "syllabuses"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]