app/controllers/students_controller.rb

  def index
    respond_with @syllabus.students.all
---
SELECT "students".* FROM "students" WHERE "students"."syllabus_id" = ?  [[nil, 1]]

    def find_syllabus
      @syllabus = Syllabus.find(params[:syllabus_id])
---
SELECT "syllabuses".* FROM "syllabuses" WHERE "syllabuses"."id" = ? LIMIT 1  [["id", "1"]]