app/controllers/syllabuses_controller.rb

SELECT "syllabuses".* FROM "syllabuses" WHERE "syllabuses"."user_id" = ? AND "syllabuses"."id" = ? LIMIT 1  [["user_id", 1], ["id", "2"]]
---
  def show
    @syllabus = @user.syllabuses.find(params[:id])