app/controllers/syllabuses_controller.rb

SELECT "syllabuses".* FROM "syllabuses" WHERE "syllabuses"."user_id" = ?  [["user_id", 1]]
---
  def index
    if(current_user == @user)
      p @user.syllabuses.all

INSERT INTO "syllabuses" ("course_num", "course_type", "created_at", "department", "location", "section_num", "term", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    params.permit!
    p "----------------------------------------"
    p params
    p "----------------------------------------"

    @record = @user.syllabuses.create(params[:syllabus])

DELETE FROM "syllabuses" WHERE "syllabuses"."id" = ?  [["id", 12]]
---
  def destroy
    respond_with Syllabus.destroy(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
  def find_user
    @user = User.find(params[:user_id])