app/controllers/users_controller.rb

  def index
    respond_with User.all
---
SELECT "users".* FROM "users"

  def show
    respond_with User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    params.permit!
 #require(:user).permit(:first_name,:last_name,:email,:school,:office,:password)
    respond_with User.create(params[:user])
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "office", "password", "school", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)